---
type: Extrusion
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# Extrusion

`Autodesk.Revit.DB.Extrusion` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | EndOffset | — | `public double EndOffset { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Sketch | — | `public Sketch Sketch { get ; }` |
| Property | StartOffset | — | `public double StartOffset { get ; set ; }` |